Masmiseim36/nxpSDK/boards/hvpkv58f/project_template/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : MB_InitANA_SENSPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void MB_InitANA_SENSPins(void)
{
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    /* PORTC8 (pin 113) is configured as HSADC1B_CH11 */
    PORT_SetPinMux(MB_I_PFC1_PORT, MB_I_PFC1_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTC9 (pin 114) is configured as HSADC1B_CH12 */
    PORT_SetPinMux(MB_I_PFC2_PORT, MB_I_PFC2_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTE17 (pin 19) is configured as HSADC0A_CH1 */
    PORT_SetPinMux(MB_U_DCB_PORT, MB_U_DCB_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTE18 (pin 20) is configured as HSADC0B_CH0 */
    PORT_SetPinMux(MB_U_DCB_HALF_PORT, MB_U_DCB_HALF_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTE19 (pin 21) is configured as HSADC0B_CH1 */
    PORT_SetPinMux(MB_TEMP_IPM_PORT, MB_TEMP_IPM_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTE29 (pin 37) is configured as HSADC0A_CH4 */
    PORT_SetPinMux(MB_I_DCB_PORT, MB_I_DCB_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTE30 (pin 38) is configured as HSADC0A_CH5 */
    PORT_SetPinMux(MB_TACHO_PORT, MB_TACHO_PIN, kPORT_PinDisabledOrAnalog);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
MB_InitBEMFPins:
- options: {callFromInitBoot: 'false', prefix: MB_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '4', peripheral: HSADC0, signal: 'ADCB, CH11', pin_signal: HSADC0B_CH11/HSADC1B_CH1/PTE3/SPI1_SIN/UART1_RTS_b/TRACE_D1}
  - {pin_num: '39', peripheral: CMP0, signal: 'IN, 4', pin_signal: HSADC0A_CH12/CMP0_IN4/CMP2_IN3}
  - {pin_num: '51', peripheral: CMP0, signal: OUT, pin_signal: PTA1/UART0_RX/FTM0_CH6/CMP0_OUT/FTM2_QD_PHA/FTM1_CH1/JTAG_TDI}
  - {pin_num: '99', peripheral: PWM0, signal: 'X, 0', pin_signal: PTB20/SPI2_PCS0/FLEXPWM0_X0/CMP0_OUT/FB_AD31, direction: INPUT}
  - {pin_num: '45', peripheral: HSADC0, signal: 'ADCB, CH4', pin_signal: HSADC0B_CH4/HSADC1B_CH4/PTE24/CAN1_TX/FTM0_CH0/XB_IN2/I2C0_SCL/EWM_OUT_b/XB_OUT4/UART4_TX}
  - {pin_num: '64', peripheral: CMP2, signal: 'IN, 0', pin_signal: CMP2_IN0/PTA12/CAN0_TX/FTM1_CH0/RMII0_RXD1/MII0_RXD1/FTM1_QD_PHA/I2C0_SCL}
  - {pin_num: '55', peripheral: CMP2, signal: OUT, pin_signal: PTA5/FTM0_CH2/RMII0_RXER/MII0_RXER/CMP2_OUT/JTAG_TRST_b}
  - {pin_num: '100', peripheral: PWM0, signal: 'X, 1', pin_signal: PTB21/SPI2_SCK/FLEXPWM0_X1/CMP1_OUT/FB_AD30, direction: INPUT}
  - {pin_num: '46', peripheral: HSADC0, signal: 'ADCB, CH5', pin_signal: HSADC0B_CH5/HSADC1B_CH5/PTE25/LLWU_P21/CAN1_RX/FTM0_CH1/XB_IN3/I2C0_SDA/EWM_IN/XB_OUT5/UART4_RX}
  - {pin_num: '66', peripheral: CMP3, signal: 'IN, 0', pin_signal: CMP3_IN0/PTA14/SPI0_PCS0/UART0_TX/CAN2_TX/RMII0_CRS_DV/MII0_RXDV/I2C1_SCL}
  - {pin_num: '102', peripheral: CMP3, signal: OUT, pin_signal: PTB23/SPI2_SIN/SPI0_PCS5/FLEXPWM0_X3/CMP3_OUT/FB_AD28}
  - {pin_num: '101', peripheral: PWM0, signal: 'X, 2', pin_signal: PTB22/SPI2_SOUT/FLEXPWM0_X2/CMP2_OUT/FB_AD29, direction: INPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : MB_InitBEMFPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void MB_InitBEMFPins(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    /* PORTA1 (pin 51) is configured as CMP0_OUT */
    PORT_SetPinMux(MB_BEMF_A_CMP_OUT_PORT, MB_BEMF_A_CMP_OUT_PIN, kPORT_MuxAlt4);

    /* PORTA12 (pin 64) is configured as CMP2_IN0 */
    PORT_SetPinMux(MB_BEMF_B_CMP_IN_PORT, MB_BEMF_B_CMP_IN_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTA14 (pin 66) is configured as CMP3_IN0 */
    PORT_SetPinMux(MB_BEMF_C_CMP_IN_PORT, MB_BEMF_C_CMP_IN_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTA5 (pin 55) is configured as CMP2_OUT */
    PORT_SetPinMux(MB_BEMF_B_CMP_OUT_PORT, MB_BEMF_B_CMP_OUT_PIN, kPORT_MuxAlt5);

    /* PORTB20 (pin 99) is configured as FLEXPWM0_X0 */
    PORT_SetPinMux(MB_BEMF_A_CAPTURE_PORT, MB_BEMF_A_CAPTURE_PIN, kPORT_MuxAlt5);

    /* PORTB21 (pin 100) is configured as FLEXPWM0_X1 */
    PORT_SetPinMux(MB_BEMF_B_CAPTURE_PORT, MB_BEMF_B_CAPTURE_PIN, kPORT_MuxAlt5);

    /* PORTB22 (pin 101) is configured as FLEXPWM0_X2 */
    PORT_SetPinMux(MB_BEMF_C_CAPTURE_PORT, MB_BEMF_C_CAPTURE_PIN, kPORT_MuxAlt5);

    /* PORTB23 (pin 102) is configured as CMP3_OUT */
    PORT_SetPinMux(MB_BEMF_C_CMP_OUT_PORT, MB_BEMF_C_CMP_OUT_PIN, kPORT_MuxAlt6);

    /* PORTE24 (pin 45) is configured as HSADC0B_CH4 */
    PORT_SetPinMux(MB_BEMF_B_PORT, MB_BEMF_B_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTE25 (pin 46) is configured as HSADC0B_CH5 */
    PORT_SetPinMux(MB_BEMF_C_PORT, MB_BEMF_C_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTE3 (pin 4) is configured as HSADC0B_CH11 */
    PORT_SetPinMux(MB_BEMF_A_PORT, MB_BEMF_A_PIN, kPORT_PinDisabledOrAnalog);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
MB_InitENCPins:
- options: {callFromInitBoot: 'false', prefix: MB_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '95', peripheral: ENC, signal: 'PHASE, A', pin_signal: PTB16/SPI1_SOUT/UART0_RX/FTM_CLKIN2/CAN0_TX/EWM_IN/XB_IN5/FB_AD17}
  - {pin_num: '110', peripheral: ENC, signal: 'PHASE, B', pin_signal: PTC5/LLWU_P9/SPI0_SCK/LPTMR0_ALT2/XB_IN2/CMP0_OUT/FTM0_CH2/FB_AD10}
  - {pin_num: '1', peripheral: ENC, signal: INDEX, pin_signal: HSADC0B_CH16/HSADC1A_CH0/PTE0/SPI1_PCS1/UART1_TX/XB_OUT10/XB_IN11/I2C1_SDA/TRACE_CLKOUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

