Masmiseim36/nxpSDK/boards/hvpkv58f/project_template/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitM2_ANA_SENSEPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitM2_ANA_SENSEPins(void)
{
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    /* PORTB0 (pin 81) is configured as HSADC0B_CH2 */
    PORT_SetPinMux(BOARD_M2_BEMF_A_PORT, BOARD_M2_BEMF_A_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTB1 (pin 82) is configured as HSADC0B_CH3 */
    PORT_SetPinMux(BOARD_M2_BEMF_B_PORT, BOARD_M2_BEMF_B_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTB2 (pin 83) is configured as HSADC0A_CH14 */
    PORT_SetPinMux(BOARD_M2_I_DCB_PORT, BOARD_M2_I_DCB_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTB3 (pin 84) is configured as HSADC0B_CH15 */
    PORT_SetPinMux(BOARD_M2_BEMF_C_PORT, BOARD_M2_BEMF_C_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTB6 (pin 87) is configured as HSADC1A_CH12 */
    PORT_SetPinMux(BOARD_M2_I_PH_B_PORT, BOARD_M2_I_PH_B_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTB7 (pin 88) is configured as HSADC1A_CH13 */
    PORT_SetPinMux(BOARD_M2_I_PH_C_PORT, BOARD_M2_I_PH_C_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTE4 (pin 7) is configured as HSADC1A_CH4 */
    PORT_SetPinMux(BOARD_M2_I_PH_A_PORT, BOARD_M2_I_PH_A_PIN, kPORT_PinDisabledOrAnalog);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitM2_MISCPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '143', peripheral: GPIOD, signal: 'GPIO, 14', pin_signal: PTD14/SPI2_SIN/XB_IN11/XB_OUT11/FLEXPWM0_A0/FB_A22}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitM2_MISCPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitM2_MISCPins(void)
{
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);

    /* PORTD14 (pin 143) is configured as PTD14 */
    PORT_SetPinMux(BOARD_M2_GPIO_PORT, BOARD_M2_GPIO_PIN, kPORT_MuxAsGpio);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
